import io
import sys

_INPUT = """\
20
124 370 105
280 200 420
425 204 302
435 141 334
212 287 231
262 410 481
227 388 466
222 314 366
307 205 401
226 460 452
336 291 119
302 104 432
478 348 292
246 337 403
102 404 371
368 399 417
291 416 351
236 263 231
170 415 482
101 339 184
20
1162
1394
1695
2501
3008
3298
4053
4093
4330
5199
5302
5869
5875
6332
6567
7483
7562
7725
9723
9845

"""
sys.stdin = io.StringIO(_INPUT)

#############ここから下をコピペ#############

#入力
N = int(input())
list_PAB = [list(map(int, input().split())) for _ in range(N)]
Q = int(input())

#処理
for i in range(Q):
    X = int(input())
    for P, A, B in list_PAB:
        if P >= X:
            X += A
        else:
            X = max(0, X - B)

    #出力
    print(X)