import io
import sys

_INPUT = """\
20
483 984529882 299667119
372 428935469 104847758
467 709733529 102461200
421 659244277 110859936
231 786224280 773073478
351 334234040 193222121
119 404159408 772024933
302 519596088 432627257
433 910226244 337833733
184 406236461 530198622
335 465203041 353047747
418 656273464 114923636
482 972364803 329650748
453 748321854 169441643
105 138464898 587159653
401 832952051 506021805
403 810916971 468755944
231 798801044 749313343
292 631278033 556088607
366 567211596 374825770

"""
sys.stdin = io.StringIO(_INPUT)

#############ここから下をコピペ#############

# 入力
N = int(input())

list_WHB = [[0, 0, 0]]
sum_W = 0
sum_B = 0
for i in range(N):
    WHB = list(map(int, input().split()))
    list_WHB.append(WHB)
    sum_W += WHB[0]
    sum_B += WHB[2]

# 処理
max_size = sum_W // 2

# dp[i][j]=頭の重さがjの時の価値（すべての部品が体の時とのうれしさの差）
dp = [[0] * (max_size + 1)]

for i in range(1, N + 1):
    W, H, B = list_WHB[i]
    V = H - B

    next_dp = dp[-1].copy()
    for j in range(W, max_size + 1):
        next_dp[j] = max(dp[-1][j], dp[-1][j - W] + V)
    dp.append(next_dp)

# 出力
out = max(dp[N]) + sum_B
print(out)
