import io
import sys

_INPUT = """\
1000 5 10
6508 11666 12167 16717 46095 55928 56542 127260 200961 202211
11754 15667 26620 31851 48890 50181 52520 53150 263650 280526
7171 7218 14268 26231 37133 47199 93385 131356 174634 189807
10290 15811 16235 39805 45168 75830 76161 137648 148368 152504
6553 22994 44284 45120 67646 68899 98726 129109 138615 247097
"""
sys.stdin = io.StringIO(_INPUT)

#############ここから下をコピペ#############

#入力
W,D,N = map(int,input().split())
list_x = [list(map(int,input().split())) for _ in range(D)]

#処理
#rect = [[] for _ in range(D)]

#出力
i0 = 0
j0 = 0
i1 = 0
j1 = W
part_w = W//N
for d in range(D):
    i0 = 0
    i1 = 0
    for k in range(N):
        i1 += part_w
        print(i0, j0, i1, j1)
        i0 = i1 + 1